Revit 2024 API
BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTagUpgrade Property
 During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementCategoryChangeInvalidatesTagUpgrade { get; }
Visual Basic
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTagUpgrade As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTagUpgrade {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TagFailures Class
Autodesk.Revit.DB Namespace